qmk/qmk_firmware/tmk_core/protocol/arm_atsam/usb/udi_cdc.c
bool udi_cdc_is_tx_ready(void)
{
	return udi_cdc_multi_is_tx_ready(0);
}

int udi_cdc_multi_putc(uint8_t port, int value)
{
	uint32_t irqflags;  //irqflags_t
	bool b_databit_9;
	uint8_t buf_sel;

#if UDI_CDC_PORT_NB == 1 // To optimize code
	port = 0;
#endif

	b_databit_9 = (9 == udi_cdc_line_coding[port].bDataBits);

udi_cdc_putc_process_one_byte:
	// Check available space
	if (!udi_cdc_multi_is_tx_ready(port)) {
		if (!udi_cdc_data_running) {
			return false;
		}
		goto udi_cdc_putc_process_one_byte;
	}

	// Write value
	irqflags = __get_PRIMASK();
  __disable_irq();
  __DMB();
	buf_sel = udi_cdc_tx_buf_sel[port];
	udi_cdc_tx_buf[port][buf_sel][udi_cdc_tx_buf_nb[port][buf_sel]++] = value;
  __DMB();
  __set_PRIMASK(irqflags);

	if (b_databit_9) {
		// Send MSB
		b_databit_9 = false;
		value = value >> 8;
		goto udi_cdc_putc_process_one_byte;
	}
	return true;
}

int udi_cdc_putc(int value)
{
	return udi_cdc_multi_putc(0, value);
}

iram_size_t udi_cdc_multi_write_buf(uint8_t port, const void* buf, iram_size_t size)
{
	uint32_t irqflags;  //irqflags_t
	uint8_t buf_sel;
	uint16_t buf_nb;
	iram_size_t copy_nb;
	uint8_t *ptr_buf = (uint8_t *)buf;

#if UDI_CDC_PORT_NB == 1 // To optimize code
	port = 0;
#endif

	if (9 == udi_cdc_line_coding[port].bDataBits) {
		size *=2;
	}

udi_cdc_write_buf_loop_wait:
	// Check available space
	if (!udi_cdc_multi_is_tx_ready(port)) {
		if (!udi_cdc_data_running) {
			return size;
		}
		goto udi_cdc_write_buf_loop_wait;
	}

	// Write values
	irqflags = __get_PRIMASK();
  __disable_irq();
  __DMB();
	buf_sel = udi_cdc_tx_buf_sel[port];
	buf_nb = udi_cdc_tx_buf_nb[port][buf_sel];
	copy_nb = UDI_CDC_TX_BUFFERS - buf_nb;
	if (copy_nb > size) {
		copy_nb = size;
	}
	memcpy(&udi_cdc_tx_buf[port][buf_sel][buf_nb], ptr_buf, copy_nb);
	udi_cdc_tx_buf_nb[port][buf_sel] = buf_nb + copy_nb;
	__DMB();
  __set_PRIMASK(irqflags);

	// Update buffer pointer
	ptr_buf = ptr_buf + copy_nb;
	size -= copy_nb;

	if (size) {
		goto udi_cdc_write_buf_loop_wait;
	}

	return 0;
}

iram_size_t udi_cdc_write_buf(const void* buf, iram_size_t size)
{
	return udi_cdc_multi_write_buf(0, buf, size);
}

#define MAX_PRINT 256
#define CDC_SEND_INTERVAL 2
uint32_t cdc_tx_send_time_next;

void CDC_send(void)
{
	while (CLK_get_ms() < cdc_tx_send_time_next);
    udi_cdc_tx_send(0);
	cdc_tx_send_time_next = CLK_get_ms() + CDC_SEND_INTERVAL;
}

uint32_t CDC_print(char * printbuf)
{
   uint32_t count=0;
   char * buf = printbuf;
   char c;

  if (CLK_get_ms() < 5000) return 0;    
  
  while ((c = *buf++) != 0 && !(count >= MAX_PRINT))
  {
    count++;
    if (!udi_cdc_is_tx_ready()) return 0;
    udi_cdc_putc(c);
    if (count >= UDI_CDC_TX_BUFFERS)
    {
      count = 0;
      CDC_send();
    }
  }
  if (count)
  {
    CDC_send();
  }
  return 1;
}


char printbuf[CDC_PRINTBUF_SIZE];

int dpf(const char *_Format, ...)
{
  va_list va;                                                       //Variable argument list variable
  int result;

  va_start(va,_Format);                                             //Initialize the variable argument list
  result = vspf(printbuf, _Format, va);
  va_end(va);
  
  CDC_print(printbuf);
  
  return result;
}  

//global "inbuf" if desired
inbuf_t inbuf;

uint32_t CDC_input_buf(inbuf_t inbuf, uint32_t inbuf_size)
{
  int RXChar;
  int entered = 0;

  if (!udi_cdc_is_rx_ready()) return 0;
  udi_cdc_get_nb_received_data();
  RXChar =  udi_cdc_getc();
//  RXChar = 0x41;
  if (RXChar)
  {
/*
    if (!uart_input_buf.in && RXChar > 0 && RXChar < 5)
    {
      Q_INIT(&uart_input_buf);
      switch (RXChar)
      {
        case 1:  //ctrl a adapter mode
         UART_adapter_mode = 1;
           break;
        case 2:  //ctrl b not adapter mode
          UART_adapter_mode = 0;
          break;
        case 3:  // ctrl c machine mode
          UART_machine_mode = 1;
          break;
        case 4:  // ctrl d not machine mode
          UART_machine_mode = 0;
          break;
      }
    }
    else
    {
      if (UART_machine_mode)
      {
        switch (RXChar)
        {
          case '\r':
            //enter
            savein = uart_input_buf.in;
            saveout = uart_input_buf.out;
            init = -1;
            UART_cksm = 0;
            UART_error = 0;
            if (UART_adapter_mode)
            {
              UART_adapter_wait_01();
              //uart_task.nextop = UART_input_01;
              //TASK_when(&uart_task,(event *)&EVT_TRUE);
              //UART_interpret();
            }
            else
            {
                                         // sumcheck will convert cksm to null character
              UART_adapter_wait_02();
              //uart_task.nextop = UART_input_02;
              //TASK_when(&uart_task,(event *)&EVT_TRUE);
              //uartnak = UART_interpret_NAK();

              //UART_input_02();
              //if(!UART_interpret_NAK())  // only OK if ACK
              //{
              //  if (!UART_error) UART_print(" ok\0");
              //}
              //else
              //{
              //  UART_print("ERROR_cksm\0");
              //}
            }
            //UART_input_01();
            //if (!UART_adapter_mode || UART_error)
            //{
            //  cksm = (unsigned char) (256-UART_cksm);
            //  if (cksm == '\r') cksm++;
            //  UART_putc(cksm);
            //  UART_putc('\r');
            //}
            //Q_INIT(&uart_input_buf);
            break;
          default:
            if (Q_CNT(&uart_input_buf) < fifo_8_space-1)
            {
              Q_ENQ(&uart_input_buf,RXChar);
            }
          break;
        }
      }
      else // not machine mode
      {
*/
        switch (RXChar)
        {
          case '\t':  //tab - repeat last
		    inbuf.count=inbuf.lastcount;
		    inbuf.buf[inbuf.count+1] = 0;
		    CDC_print(inbuf.buf);
            break;
          case '\r':  //enter
            inbuf.buf[inbuf.count]=0;
            inbuf.lastcount = inbuf.count;
            inbuf.count = 0;
            entered = 1;
            break;
          case '\b': //backspace
            if (inbuf.count > 0) {
              inbuf.count -= 1;
              CDC_print("\b \b\0");
            }
            else
              CDC_print("\a\0");
            break;
          default:
            if ((RXChar >= 32) && (RXChar <= 126))
            {
              if (inbuf.count < inbuf_size-1)
              {
                inbuf.buf[inbuf.count] = RXChar;
                inbuf.buf[inbuf.count+1] = 0;
                CDC_print(&inbuf.buf[inbuf.count]);
                inbuf.count += 1;
              }
              else
                CDC_print("\a\0");
            }
            break;
		}
    RXChar = 0;
   }
   return entered;
}

uint32_t CDC_input()
{
  return CDC_input_buf(inbuf, CDC_INBUF_SIZE);
}

void CDC_init(void)
{
   inbuf.count = 0;
   inbuf.lastcount = 0;
   printbuf[0] = 0;
   cdc_tx_send_time_next = CLK_get_ms() + CDC_SEND_INTERVAL;
}

#else
char printbuf[CDC_PRINTBUF_SIZE];


void CDC_send(void)
{
 return;
}


uint32_t CDC_print(char * printbuf)
{ 
  return 0;
}

int dpf(const char *_Format, ...)
{
  return 0;

}

inbuf_t inbuf;

uint32_t CDC_input(void)
{
  return 0;
}

void CDC_init(void)
{
   inbuf.count = 0;
   inbuf.lastcount = 0;
   printbuf[0]=0;
}

char printbuf[CDC_PRINTBUF_SIZE];

#endif





//@}
